# IS 362 â€“ Week 7 Assignment

In [1]:
import pandas as pd

## Film Ratings Average by Viewer

In [2]:
ratings = pd.read_csv('Viewer_Ratings.csv', index_col = 0)
ratings

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,5.0,4.0,3,NaN,NaN,4.0
Logan,4.0,NaN,3,3.0,NaN,NaN
Modesto,NaN,NaN,4,NaN,4.0,4.0
Malcolm,NaN,NaN,2,NaN,4.0,NaN
Maurice,5.0,4.0,4,2.0,3.0,3.0

### Film Rating Averages

These are film rating averages calculated based on the score of whomever viewed the film.

In [3]:
average = ratings.mean()
score_avg = pd.DataFrame(average)
score_avg.columns = ['Film Rating Average']
score_avg

                     Film Rating Average
American Sniper                 4.666667
Edge of Tomorrow                4.000000
Groundhog Day                   3.200000
Jurassic World                  2.500000
Lost in Translation             3.666667
Lucy                            3.666667

### Viewer Score Averages

These are the averages calculated based on the scores the viewers gave whatever film they viewed.

In [4]:
viewer_score = ratings.mean(axis=1)
view_avg = pd.DataFrame(viewer_score)
view_avg.columns = ['Viewer Score Average']
view_avg

         Viewer Score Average
John                 4.000000
Logan                3.333333
Modesto              4.000000
Malcolm              3.000000
Maurice              3.500000

## Normalized Averaged Ratings

Here, unlike the actual data, their averages are calculated based on their respective sample sizes by group (e.g., film or viewer). Since their sample sizes are different, their averages are calculated from different scales to one another. Normalization is done to calculate these values to be on the same measurement scale, from a value between 0 to 1; ensuring that these values are properly made proportional to one another.

In [5]:
ratings_norm = ratings.copy()
movies = list(ratings.columns)

ratings_norm = (ratings_norm[movies] - ratings_norm[movies].min()) / (ratings_norm[movies].max() - ratings_norm[movies].min())
ratings_norm

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,1.0,NaN,0.5,NaN,NaN,1.0
Logan,0.0,NaN,0.5,1.0,NaN,NaN
Modesto,NaN,NaN,1.0,NaN,1.0,1.0
Malcolm,NaN,NaN,0.0,NaN,1.0,NaN
Maurice,1.0,NaN,1.0,0.0,0.0,0.0

### Normalized Film Ratings Average

In [6]:
norm_film_ratings = ratings_norm.mean()
normalized_film_average = pd.DataFrame(norm_film_ratings)
normalized_film_average.columns = ['Normalized Film Rating Average']
normalized_film_average

                     Normalized Film Rating Average
American Sniper                            0.666667
Edge of Tomorrow                                NaN
Groundhog Day                              0.600000
Jurassic World                             0.500000
Lost in Translation                        0.666667
Lucy                                       0.666667

### Normalized Viewer Ratings Average

In [7]:
norm_view_ratings = ratings_norm.mean(axis=1)
normalized_viewer_average = pd.DataFrame(norm_view_ratings)
normalized_viewer_average.columns = ['Normalized Viewer Ratings Average']
normalized_viewer_average

         Normalized Viewer Ratings Average
John                              0.833333
Logan                             0.500000
Modesto                           1.000000
Malcolm                           0.500000
Maurice                           0.400000

## Normalized Ratings vs. Actual Ratings

Normalization is primarily used to change the values of a dataset to a common scale, enabling for comparisons and interpretations to be more accurate without distorting the difference in range of values or losing information. While this is useful for ensuring that all values are on the same scale, it will not be useful if data tables would have values of different scales and/or measurement units, and if this is intentional.

The normalized data would make it clear to analyze and identify any underlying differences and deviations not present in the data at face value. This is made clear that while some of the values of the actual data may be equivalent to one another for film ratings, not everyone watched the same amount of movies, gave the same score to the film, nor watched every film. In this scenario, normalizing the data shows the scale in proportion for both the films and the viewers, the ratings the films received and the scores the viewers gave being proportional to one another on the same scale. Such examples include whether the movie received the same score from the multiple people, or whether the rating the person gave for all of the movies they viewed was consistent.

For actual ratings, it gives the average overall for either the films or viewers regardless of whether or not the viewer watched or reviewed said film, hence why some of the values in the dataframe with the actual score values have null values. However, the sample sizes between the film ratings and viewer scores are not proportional to one another. Thus, normalization was required to make the scales equivalent to one another to make a clearer comparison between the films and viewers (e.g., such as whether the film got a higher score or whether the film viewer consistently gave a high score). However, **Edge of Tomorrow** is an exception since the film got the same score between the sample size of two people, and calculating it for it to be normalized is impossible as the calculated denominator will be 0. Thus, the **Edge of Tomorrow** column is full of null values, as there is no variance of values in the sample size, nor is the sample size large enough.

Though, actual ratings has an advantage when wanting to use the real value of the data, regardless of sample size, wanting to know the average score of the film based on the pre-established scale given. This sort of context is easier to understand at a glance, accomodating for people that may not be adept in statistic normalization.

## Standardized Ratings (Extra Credit)

My attempt at the extra credit prompt, though I am unsure if this is done correctly.

In [8]:
ratings_z_scaled = ratings.copy()
movies = list(ratings.columns)

ratings_z_scaled = (ratings_z_scaled[movies] - ratings_z_scaled[movies].mean()) / ratings_z_scaled[movies].std()
ratings_z_scaled

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,0.577350,NaN,-0.239046,NaN,NaN,0.577350
Logan,-1.154701,NaN,-0.239046,0.707107,NaN,NaN
Modesto,NaN,NaN,0.956183,NaN,0.577350,0.577350
Malcolm,NaN,NaN,-1.434274,NaN,0.577350,NaN
Maurice,0.577350,NaN,0.956183,-0.707107,-1.154701,-1.154701

In [9]:
stand_film_ratings = ratings_z_scaled.mean()
standardized_film_average = pd.DataFrame(stand_film_ratings)
standardized_film_average.columns = ['Standardized Film Rating Average']
standardized_film_average

                     Standardized Film Rating Average
American Sniper                         -5.181041e-16
Edge of Tomorrow                                  NaN
Groundhog Day                           -1.998401e-16
Jurassic World                           0.000000e+00
Lost in Translation                      2.960595e-16
Lucy                                     2.960595e-16

In [10]:
stand_view_ratings = ratings_z_scaled.mean(axis=1)
standardized_viewer_average = pd.DataFrame(stand_view_ratings)
standardized_viewer_average.columns = ['Standardized Viewers Ratings Average']
standardized_viewer_average

         Standardized Viewers Ratings Average
John                                 0.305218
Logan                               -0.228880
Modesto                              0.703628
Malcolm                             -0.428462
Maurice                             -0.296595

### Note:

I am unsure if I had done this correctly, but if it is, I would not recommend *standardizing* the data, for either the film ratings or their viewers, especially for the former.

For the films, the standardized averages are drastically diffferent from one another, except for **Lost in Translation** and **Lucy**. For **Edge of Tomorrow**, both of their ratings are the same and was viewed by only two people, hence why when calculated, it will result in null values as there is no deviation between the same values.

## Test Blocks, Ignore Please

These blocks of code were tests when trying to figure out how to complete the project. They are irrelevant for now but will be kept in case for future reference.

In [11]:
#movies = list(ratings.columns)
#standardized_film_average = ratings.groupby(movies).mean()
#standardized_film_average.T

In [12]:
#audience = list(ratings.T.columns)
# Adding the "T" substitiutes the need for axis=1, it switches the column and row/index headers
#standardized_audience_average = ratings.T.groupby(audience).mean()
#standardized_audience_average.T